Revit 2027 API
IndependentTag.GetTaggedElementIds Method
 Returns a set of LinkElementId for all tagged elements, if any. A LinkElementId will be provided for each subelement that is being referenced by the tag.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<LinkElementId> GetTaggedElementIds()
Public Function GetTaggedElementIds As ICollection(Of LinkElementId)
public:
ICollection<LinkElementId^>^ GetTaggedElementIds()
member GetTaggedElementIds : unit -> ICollection<LinkElementId>
Return Value
ICollection<LinkElementId>
 Set of all the tagged elements ids for both local and linked files.
Remarks
 All the returned LinkElementIds will be valid even when IsOrphaned is true.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace